// Работаем с коллекцией карточек в trello
//     - метод splice()
//     - удалить
//     - добавить
//     - обновить

const cards = [
  'Карточка-1',
  'Карточка-2',
  'Карточка-3',
  'Карточка-4',
  'Карточка-5',
  'Карточка-6',
];

console.table(cards);

// Удаление (по индексу), метод indexof()

// Создаем переменну с карточкой которую хотим удалить
const cardToRenove = 'Карточка-3';
// Определяем индекс нашей карточки в массиве
const index1 = cards.indexOf(cardToRenove);
console.log(index1)
// Через метод .splice удаляем необходимое кол-во значений в массиве, начиная с указанного стартового
// индекса. В нашем случае мы определили, что начальным индексом будет индекс для 'Карточка-3', который
// равен "2". Далее в методе после начального индекса задаем кол-во значений. в нашем случае 1, которые
// хотим удалить.  

cards.splice(index1, 1);
console.table(cards);


// Добавление (по индексу)
// Для добавления элемента в массив есть методы push, pop и shift, но дело в том, что эти методы,
// добавляют элемент либо в начало либо в конец массива. В нашем случае необходимо добавить в середину.
// Для того, щоб додати один або декілька елементів в масив, необхідно передати три або більше аргументи, за такої умови, другий аргумент повинен дорівнювати нулю.
// splice(position, 0, new_element_1, new_element_2, ...)
// Аргумент position вказує початкову позицію в масиві, куди будуть вставлені нові елементи.
// Другий аргумент - це нуль, він говорить методу не видаляти елементи в місці додавання нових.
// Третій, четвертий і всі наступні аргументи - це нові елементи, які додаються в масив.
// Наприклад, у нас є масив з назвами кольорів у вигляді рядків. Додамо новий колір перед елементом з індексом 2.
// const colors = ["red", "green", "blue"];
// colors.splice(2, 0, "purple");
// console.log(colors); // ["red", "green", "purple", "blue"]

const cardToInsert = 'Карточка-7';
const index2 = 3;
cards.splice(index2, 0, cardToInsert); 
console.table(cards);


// Обновление по (индексу)

// Заміна - це операція додавання, в якій видаляються елементи в місці додавання нових. 
// Для цього необхідно передати мінімум три аргументи.Кількість елементів, що видаляються і
// додаються, може не збігатися.
// splice(position, num, new_element_1, new_element_2, ...)
// position - вказує на позицію (індекс) першого елемента для видалення
// num - визначає кількість елементів, що видаляються
// Третій, четвертий і всі наступні аргументи - це нові елементи, які додаються в масив.
// Наприклад, у нас є масив мов програмування з чотирьох елементів.
// const languages = ["C", "C++", "Java", "JavaScript"];
// Заміняємо елемент з індексом 1 на новий
// languages.splice(1, 1, "Python");
// console.log(languages); // ["C", "Python", "Java", "JavaScript"]
// Заміняємо один елемент (з індексом 2) на декілька
// languages.splice(2, 1, "C#", "Swift", "Go");
// console.log(languages); // ["C", "Python", "C#", "Swift", "Go", "JavaScript"]

const cardToUpdate = 'Карточка-4';
const index3 = 0;
cards.splice(index3, 1, cardToUpdate);
console.table(cards);

// или:

const cardToUpdate1 = 'Карточка-4';
const index4 = cards.indexOf(cardToUpdate1);
cards.splice(index4, 1, 'Супер обновленная карточка-4');
console.table(cards);